package logic

var (
	projectNameMap = map[string]string{
		"甲胎蛋白":              "甲胎蛋白", //99
		"甲胎蛋白(AFP)":         "甲胎蛋白",
		"甲胎蛋白(AFP)(Max)":    "甲胎蛋白",
		"糖链抗原CA19-9":        "糖链抗原CA19-9", //100
		"糖类抗原CA19-9(Max)":   "糖链抗原CA19-9",
		"CA19-9":            "糖链抗原CA19-9",
		"糖抗原CA19-9":         "糖链抗原CA19-9",
		"糖抗原CA199":          "糖链抗原CA19-9",
		"糖类抗原CA125(Max)":    "糖链抗原CA125", // 101
		"糖链抗原CA125":         "糖链抗原CA125",
		"糖抗原CA125":          "糖链抗原CA125",
		"CA125":             "糖链抗原CA125",
		"癌胚抗原":              "癌胚抗原(CEA)", // 102
		"癌胚抗原(CEA)":         "癌胚抗原(CEA)",
		"癌胚抗原(CEA)(Max)":    "癌胚抗原(CEA)",
		"糖类抗原CA15-3":        "糖类抗原CA15-3",
		"糖类抗原CA153(Max)":    "糖类抗原CA15-3",
		"糖类抗原CA153":         "糖类抗原CA15-3",
		"糖抗原CA153":          "糖类抗原CA15-3",
		"CA153":             "糖类抗原CA15-3", //103
		"糖类抗原CA724(Max)":    "糖链抗原CA72-4",
		"糖链抗原CA72-4":        "糖链抗原CA72-4", // 104
		"抗Jo-1":             "抗Jo-1",      // 154
		"抗Jo-1抗体":           "抗Jo-1",
		"天门冬氨酸转氨酶(AST)":     "天门冬氨酸转氨酶(AST)", // 39
		"天门冬氨酸转氨酶":          "天门冬氨酸转氨酶(AST)",
		"线粒体型(AST)":         "线粒体型天门冬氨酸转氨酶",
		"线粒体型天门冬氨酸转氨酶":      "线粒体型天门冬氨酸转氨酶", //37
		"维生素D3":             "维生素D3",        //105
		"25-羟维生素D3":         "维生素D3",
		"25羟基维生素D3":         "维生素D3",
		"三碘甲状腺原氨酸":          "总三碘甲状腺原氨酸", // 112
		"总三碘甲状腺原氨酸":         "总三碘甲状腺原氨酸",
		"促甲状腺激素":            "促甲状腺激素", //114
		"促甲状腺素":             "促甲状腺激素",
		"促甲状腺刺激激素":          "促甲状腺激素",
		"ANA核型：":            "ANA（IIF）",
		"核型：":               "ANA（IIF）",
		"0.263888889":       "ANA（IIF）",
		"0.111111111":       "ANA（IIF）",
		"2.263888889":       "ANA（IIF）",
		"抗核抗体次要核型":          "ANA（IIF）",
		"抗核抗体主荧光核型":         "ANA（IIF）",
		".":                 "ANA（IIF）",
		"ANA（IIF）":          "ANA（IIF）", //162
		"抗核抗体":              "抗核抗体（定性）", //144
		"抗核抗体（定性）":          "抗核抗体（定性）",
		"抗核点抗体":             "抗核抗体（定性）",
		"抗PML":              "抗PML", //169
		"抗PML抗体":            "抗PML",
		"抗线粒体抗体M2":          "抗线粒体M2", //174
		"抗线粒体M2":            "抗线粒体M2",
		"抗线粒体抗体（AMA-M2）":    "抗线粒体M2",
		"抗中性粒细胞胞浆抗体(pANCA)": "pANCA", // 175
		"pANCA":             "pANCA", //175
		"抗中性粒细胞胞浆抗体(cANCA)": "cANCA", //176
		"cANCA":             "cANCA", //176
		"抗核小体":              "抗核小体",  //158
		"抗核小体抗体":            "抗核小体",
		"抗sm":               "抗sm抗体", //177
		"抗sm抗体":             "抗sm抗体",
		"抗SSA":              "抗SSA", //149
		"抗SSA抗体":            "抗SSA",
		"抗SSA'":             "抗SSA",
		"SSA":               "抗SSA",
		"抗SSB":              "抗SSB", //151
		"抗SSB抗体":            "抗SSB",
		"SSB":               "抗SSB",
		"抗Scl-70":           "抗ScL-70", //152
		"抗ScL-70抗体":         "抗ScL-70",
		"抗PM-Scl":           "抗PM-Scl", //153
		"抗PM-Scl抗体":         "抗PM-Scl",
		"抗PM-ScI":           "抗PM-Scl",
		"抗Ro-52":            "抗Ro-52", //150
		"抗RO-52抗体":          "抗Ro-52",
		"抗Ro-52抗体":          "抗Ro-52",
		"1:10":              "抗核抗体（1：10）", //126
		"1：10":              "抗核抗体（1：10）",
		"抗核抗体（1：10）":        "抗核抗体（1：10）",
		"1：20":              "抗核抗体（1：20）", //127
		"抗核抗体（1：20）":        "抗核抗体（1：20）",
		"1：100":             "抗核抗体(1:100)", //131
		"抗核抗体(1:100)":       "抗核抗体(1:100)",
		"1：160":             "抗核抗体(1:160)", //132
		"抗核抗体(1:160)":       "抗核抗体(1:160)",
		"1：320":             "抗核抗体(1:320)", //133
		"1:320":             "抗核抗体(1:320)",
		"1: 320":            "抗核抗体(1:320)",
		"1：10000":           "抗核抗体(1:10000)", //140
		"抗核抗体(1:10000)":     "抗核抗体(1:10000)",
		"1：100000":          "1：100000", //142
		"抗核抗体(1:100000)":    "1：100000",
		"1：1000":            "抗核抗体(1:1000)", // 135
		"抗核抗体(1:1000)":      "抗核抗体(1:1000)",
		"1：2560":            "抗核抗体(1:2560)", //137
		"抗核抗体(1:2560)":      "抗核抗体(1:2560)",
		"1：1280":            "抗核抗体(1:1280)", //136
		"抗核抗体(1:1280)":      "抗核抗体(1:1280)",
		"1：3200":            "抗核抗体(1:3200)", //138
		"抗核抗体（1:3200）":      "抗核抗体(1:3200)",
		"抗nRNP/sm":          "抗nRNP/Sm", //147
		"抗nRNP/Sm":          "抗nRNP/Sm",
		"抗核抗体（1：32）":        "抗核抗体(1:32)", //128
		"1：32":              "抗核抗体(1:32)",
		"快速血沉试验":            "快速血沉试验", //109
		"血沉":                "快速血沉试验",
		"快速血沉试验 ":           "快速血沉试验",
		"免疫球蛋白M":            "血清免疫球蛋白M", //82
		"血清免疫球蛋白M":          "血清免疫球蛋白M",
		"免疫球蛋白A":            "血清免疫球蛋白A", //81
		"血清免疫球蛋白A":          "血清免疫球蛋白A",
		"免疫球蛋白G":            "血清免疫球蛋白G", // 80
		"血清免疫球蛋白G":          "血清免疫球蛋白G",
		"C反应蛋白":             "超敏C反应蛋白", //88
		"超敏C反应蛋白":           "超敏C反应蛋白",
		"C-反应蛋白":            "超敏C反应蛋白",
		"白细胞定量":             "尿白细胞定量", //121
		"尿白细胞定量":            "尿白细胞定量",
		"抗EBV壳抗原抗体IgG":      "抗EBV衣壳抗体IgG", //90
		"抗EBV衣壳抗体IgG":       "抗EBV衣壳抗体IgG",
		"抗EB病毒早期抗原抗体IgG":    "抗EBV早期抗体IgG", //92
		"抗EBV早期抗体IgG":       "抗EBV早期抗体IgG",
		"抗EBV早期抗原抗体IgG":     "抗EBV早期抗体IgG",
		"抗着丝点蛋白B":           "抗着丝点蛋白B",        //155
		"1,3-β-D葡聚糖(血液)":    "1,3-β-D葡聚糖(血液)", //107
		"1,3-β-D葡聚糖":        "1,3-β-D葡聚糖(血液)",
		"胱抑素C":              "胱抑素C",      // 68
		"免疫球蛋白G亚类4":         "免疫球蛋白G亚类4", //84
		"IgG4":              "免疫球蛋白G亚类4",
		"免疫球蛋白G亚类3":         "免疫球蛋白G亚类3", //85
		"IgG3":              "免疫球蛋白G亚类3",
		"免疫球蛋白G亚类2":         "免疫球蛋白G亚类2", //86
		"IgG2":              "免疫球蛋白G亚类2",
		"免疫球蛋白G亚类1":         "免疫球蛋白G亚类1", //87
		"IgG41":             "免疫球蛋白G亚类1",
		"血清α-L-岩藻糖苷酶":       "α-L-岩藻糖苷酶(AFU)", // not found
		"α-L-岩藻糖苷酶(AFU)":    "α-L-岩藻糖苷酶(AFU)",
		//"乙肝核心抗体定量":          "乙肝核心抗体定量", // not found
		//"乙型肝炎病毒核心抗体":        "乙肝核心抗体定量",
		//"乙肝核心抗体":            "乙肝核心抗体定量",
		//"乙肝核心抗体(电化学发光法)":    "乙肝核心抗体定量",
		//"乙肝核心抗体(化学发光法)":     "乙肝核心抗体定量",
		//"乙肝E抗体":             "乙肝E抗体定量", // not found
		//"乙肝E抗体(电化学发光法)":     "乙肝E抗体定量",
		//"乙肝E抗体(化学发光法)":      "乙肝E抗体定量",
		//"乙肝E抗体定量":           "乙肝E抗体定量",
		//"乙型肝炎病毒e抗体":         "乙肝E抗体定量",
		//"乙肝E抗原":             "乙肝E抗原定量", // not found
		//"乙肝E抗原(电化学发光法)":     "乙肝E抗原定量",
		//"乙肝E抗原(化学发光法)":      "乙肝E抗原定量",
		//"乙型肝炎病毒e抗原":         "乙肝E抗原定量",
		//"乙肝E抗原定量":           "乙肝E抗原定量",
		//"乙肝表面抗原":            "乙肝表面抗原定量", // not found
		//"乙肝表面抗原定量":          "乙肝表面抗原定量",
		//"乙肝表面抗原(电化学发光法)":    "乙肝表面抗原定量",
		//"乙型肝炎病毒表面抗原":        "乙肝表面抗原定量",
		//"乙肝表面抗原(化学发光法)":     "乙肝表面抗原定量",
		//"乙型肝炎病毒表面抗体":        "乙肝表面抗体定量", // not found
		//"乙肝表面抗体定量":          "乙肝表面抗体定量",

		//"丙肝抗体定性":           "丙型肝炎病毒抗体", // not found
		//"丙型肝炎病毒抗体":         "丙型肝炎病毒抗体",
		//"抗丙型肝炎病毒抗体":        "丙型肝炎病毒抗体",
		//"丙肝抗体（电化学发光法）":     "丙型肝炎病毒抗体",
		//"高敏乙型肝炎病毒核酸定量":     "高敏乙肝DNA定量", // not found
		//"高敏乙肝DNA定量":        "高敏乙肝DNA定量",
		//"乙肝病毒DNA定量":        "乙肝病毒定量", // not found
		//"乙肝病毒定量":           "乙肝病毒定量",
		//"丙肝病毒定量":           "丙肝病毒定量", // not found
		//"丙肝病毒DNA定量":        "丙肝病毒定量",

		"白细胞计数":            "白细胞计数",            //27
		"中性粒细胞绝对值":         "中性粒细胞绝对值",         //28
		"淋巴细胞绝对值":          "淋巴细胞绝对值",          //29
		"单核细胞绝对值":          "单核细胞绝对值",          //30
		"红细胞计数":            "红细胞计数",            //31
		"血红蛋白":             "血红蛋白",             //32
		"血细胞比容":            "血细胞比容",            //33
		"平均红细胞体积":          "平均红细胞体积",          //34
		"血小板计数":            "血小板计数",            //35
		"腺苷脱氨酶":            "腺苷脱氨酶",            //36
		"丙氨酸氨基转移酶(ALT)":    "丙氨酸氨基转移酶(ALT)",    //38
		"总蛋白":              "总蛋白",              //40
		"球蛋白":              "球蛋白",              //41
		"白蛋白":              "白蛋白",              //42
		"总胆红素":             "总胆红素",             //43
		"直接胆红素":            "直接胆红素",            //44
		"间接胆红素":            "间接胆红素",            //45
		"碱性磷酸酶":            "碱性磷酸酶",            //46
		"γ-谷氨酰基转移酶":        "γ-谷氨酰基转移酶",        //47
		"总胆汁酸":             "总胆汁酸",             //48
		"亮氨酸氨基肽酶":          "亮氨酸氨基肽酶",          //49
		"白蛋白/球蛋白":          "白蛋白/球蛋白",          //50
		"AST/ALT":          "AST/ALT",          //51
		"总胆固醇":             "总胆固醇",             //52
		"甘油三脂":             "甘油三脂",             //53
		"高密度脂蛋白胆固醇":        "高密度脂蛋白胆固醇",        //54
		"低密度脂蛋白胆固醇(LDL_C)": "低密度脂蛋白胆固醇(LDL_C)", //55
		"尿素":               "尿素",               //56
		"肌酐":               "肌酐",               //57
		"葡萄糖":              "葡萄糖",              //58
		"糖化血红蛋白":           "糖化血红蛋白",           //59
		"尿酸":               "尿酸",               //60
		"载脂蛋白A1":           "载脂蛋白A1",           //61
		"载脂蛋白B":            "载脂蛋白B",            //62
		"钾":                "钾",                //63
		"钠":                "钠",                //64
		"氯":                "氯",                //65
		"总钙":               "总钙",               //66
		"二氧化碳":             "二氧化碳",             //67
		"无机磷":              "无机磷",              //69
		"肌酸激酶":             "肌酸激酶",             //70
		"血清胆碱脂酶":           "血清胆碱脂酶",           //71
		"凝血酶原时间":           "凝血酶原时间",           //72
		"活化部分凝血活酶时间":       "活化部分凝血活酶时间",       //73
		"纤维蛋白原含量":          "纤维蛋白原含量",          //74
		"凝血酶时间":            "凝血酶时间",            //75
		"D-二聚体":            "D-二聚体",            // 76
		"纤维蛋白原降解产物(血浆)":    "纤维蛋白原降解产物(血浆)",    //77
		"凝血酶原活动度":          "凝血酶原活动度",          //78
		"PT国际标准化比值":        "PT国际标准化比值",        //79
		"血清免疫球蛋白E":         "血清免疫球蛋白E",         //83
		"巨细胞病毒抗体IgM":       "巨细胞病毒抗体IgM",       //89
		"抗EBV核抗体IgG":       "抗EBV核抗体IgG",       //91
		"抗EBV衣壳抗体IgM":      "抗EBV衣壳抗体IgM",      //93
		"抗EBV壳抗体IgG亲合力":    "抗EBV壳抗体IgG亲合力",    //94
		"EBV Zta蛋白抗体IgA":   "EBV Zta蛋白抗体IgA",   // 95
		"抗EBV衣壳抗体IgA":      "抗EBV衣壳抗体IgA",      //96
		"抗EBV核抗体IgA":       "抗EBV核抗体IgA",       //97
		"异常凝血酶原":           "异常凝血酶原",           //98
		"内毒素定量(血液)":        "内毒素定量(血液)",        //106
		"血浆氨":              "血浆氨",              //108
		"游离三碘甲状腺原氨酸":       "游离三碘甲状腺原氨酸",       //110
		"游离甲状腺素":           "游离甲状腺素",           //111
		"总甲状腺素":            "总甲状腺素",            //113
		"尿白细胞定性":           "尿白细胞定性",           //115
		"尿蛋白定性":            "尿蛋白定性",            //116
		"尿胆原定性":            "尿胆原定性",            //117
		"尿胆红素定性":           "尿胆红素定性",           //118
		"尿红细胞定性":           "尿红细胞定性",           //119
		"尿红细胞定量":           "尿红细胞定量",           //120
		"尿细菌定量":            "尿细菌定量",            //122
		//"第一次":              "第一次",    // 尿的应该不需要吧
		//"第二次":              "第二次",	// 尿的应该不需要吧
		//"第三次":              "第三次",	// 尿的应该不需要吧
		"抗U1-nRNP抗体":     "抗U1-nRNP抗体",     //145
		"抗U1-snRNP抗体":    "抗U1-snRNP抗体",    //146
		"抗增殖细胞核抗原":       "抗增殖细胞核抗原",       //156
		"抗双链DNA抗体":       "抗双链DNA抗体",       //157
		"抗组蛋白":           "抗组蛋白",           //159
		"抗核糖体P蛋白":        "抗核糖体P蛋白",        //160
		"自身免疫性肝病抗体检测":    "自身免疫性肝病抗体检测",    //161
		"抗线粒体抗体":         "抗线粒体抗体",         //163
		"抗肝肾微粒体":         "抗肝肾微粒体",         //164
		"抗肝抗原":           "抗肝抗原",           //165
		"抗平滑肌抗体":         "抗平滑肌抗体",         //166
		"抗3E（BPO）":       "抗3E（BPO）",       //167
		"抗Sp100":         "抗Sp100",         // 168
		"抗gp210":         "抗gp210",         //170
		"抗肝肾微粒体抗体":       "抗肝肾微粒体抗体",       //171
		"抗肝细胞溶质抗原I抗体":    "抗肝细胞溶质抗原I抗体",    // 172
		"抗可溶性肝抗原/肝胰抗原抗体": "抗可溶性肝抗原/肝胰抗原抗体", //173

		"乙肝E抗体":         "乙肝E抗体定量", //236
		"乙肝E抗体(电化学发光法)": "乙肝E抗体定量",
		"乙肝E抗体(化学发光法)":  "乙肝E抗体定量",
		"乙肝E抗体定量":       "乙肝E抗体定量",
		"乙型肝炎病毒e抗体":     "乙肝E抗体定量",

		"乙肝E抗原":         "乙肝E抗原定量", //237
		"乙肝E抗原(电化学发光法)": "乙肝E抗原定量",
		"乙肝E抗原(化学发光法)":  "乙肝E抗原定量",
		"乙型肝炎病毒e抗原":     "乙肝E抗原定量",
		"乙肝E抗原定量":       "乙肝E抗原定量",

		"乙肝表面抗原":         "乙肝表面抗原定量", //239
		"乙肝表面抗原定量":       "乙肝表面抗原定量",
		"乙肝表面抗原(电化学发光法)": "乙肝表面抗原定量",
		"乙型肝炎病毒表面抗原":     "乙肝表面抗原定量",
		"乙肝表面抗原(化学发光法)":  "乙肝表面抗原定量",

		"乙型肝炎病毒表面抗体": "乙肝表面抗体定量", //238
		"乙肝表面抗体定量":   "乙肝表面抗体定量",

		"乙肝核心抗体":         "乙肝核心抗体定量", //240
		"乙肝核心抗体(电化学发光法)": "乙肝核心抗体定量",
		"乙肝核心抗体(化学发光法)":  "乙肝核心抗体定量",
		"乙肝核心抗体定量":       "乙肝核心抗体定量",
		"乙型肝炎病毒核心抗体":     "乙肝核心抗体定量",

		"丙肝抗体定性":       "丙肝抗体定性", //245
		"丙型肝炎病毒抗体":     "丙肝抗体定性",
		"抗丙型肝炎病毒抗体":    "丙肝抗体定性",
		"丙肝抗体（电化学发光法）": "丙肝抗体定性",
		"丙肝抗体（化学发光法）":  "丙肝抗体定性",
		"丙肝抗体定量":       "丙肝抗体定性",

		"高敏乙型肝炎病毒核酸定量": "高敏乙肝DNA定量", //241
		"高敏乙肝DNA定量":    "高敏乙肝DNA定量",

		"乙肝病毒DNA定量":  "乙肝病毒定量", //242
		"乙肝病毒定量":     "乙肝病毒定量",
		"乙型肝炎病毒核酸定量": "乙肝病毒定量",

		"丙肝病毒定量":    "丙肝病毒定量", //244
		"丙肝病毒RNA定量": "丙肝病毒定量",

		"高敏丙肝RNA定量":    "高敏丙肝RNA定量", //243
		"高敏丙型肝炎病毒核酸定量": "高敏丙肝RNA定量",
	}
)
